
from wit import Wit

client = Wit('OM44BHVFIPXE6QCNIJDAR5FD7WD672VI')  # Integration With Wit


def handle_message(msg):
    msg = client.message(msg)
    if msg == 'توقف': # not working
        return 'اتمنى الخدمه حازت على رضاك'

    questions = {'لم', 'متى', 'هو', 'هي', 'ماذا', 'شلون', 'كيف', 'لماذا', 'هل', 'وكيف', 'وماذا', 'ولماذا', 'ومتى',
                 'وهل', 'ومن', 'وشلون'}
    question_counter = 0

    splt_txt = msg.get('text').split()
    for i in splt_txt:
        if (i in questions):
            question_counter += 1

    if (question_counter > 1):
        return 'ادخل سؤال واحد من فضلك'
    else:
        try:
            if msg.get('intents')[0].get('confidence') > 0.68:
                intent = msg.get('intents')[0].get('name')
                if intent == "greeting" or msg.get('entities').get('Salam:Salam') != None or msg.get('entities').get(
                        'Hala:Hala') != None or msg.get('entities').get('good_evening:good_evening') != None or msg.get(
                    'entities').get('good_morning:good_morning') != None:
                    return process_greeting(msg)
                if intent == "t3aruf":
                    return process_t3aruf(msg)
                if intent == "patent":
                    return process_patent(msg)
                if intent == "ip":
                    return process_ip(msg)
            else:
                return 'آسفه لا استطيع اجابتك'

        except IndexError:
            return 'آسفه لا استطيع اجابتك'


def conversation():
    return """يمكنك التسجيل لـ:
 1 - البراءات (التصاميم المعمارية، النماذج الصناعية، الأصناف النباتية، التطبيقات الإلكترونية، تصاميم الدارات المتكاملة) عن طريق الرابط: epatentsso.saip.gov.sa
 2- الاعمال المحمية بنظام حقوق المؤلف والحقوق المجاورة عن طريق الرابط: copyright.saip.gov.sa
 3-  العلامات التجارية عن طريق الرابط: tm.saip.gov.sa
 4- ترخيص ممارسة أنشطة الملكية الفكرية عن طريق الرابط: agent.saip.gov.sa """


def process_greeting(msg):
    if msg.get('entities').get('Salam:Salam') != None:
        if msg.get('entities').get('Salam:Salam')[0].get('name') == "Salam":
            if msg.get('entities').get('Salam:Salam')[0].get('confidence') > 0.70:
                return "وعليكم السلام"
    if msg.get('entities').get('Hala:Hala') != None:
        if msg.get('entities').get('Hala:Hala')[0].get('name') == "Hala":
            if msg.get('entities').get('Hala:Hala')[0].get('confidence') > 0.70:
                return "اهلا وسهلا"
    if msg.get('entities').get('good_evening:good_evening') != None:
        if msg.get('entities').get('good_evening:good_evening')[0].get('name') == "good_evening":
            if msg.get('entities').get('good_evening:good_evening')[0].get('confidence') > 0.70:
                return "مساء النور"
    if msg.get('entities').get('good_morning:good_morning') != None:
        if msg.get('entities').get('good_morning:good_morning')[0].get('name') == "good_morning":
            if msg.get('entities').get('good_morning:good_morning')[0].get('confidence') > 0.70:
                return "صباح النور"
    if msg.get('entities').get('thanks:thanks') != None:
        if msg.get('entities').get('thanks:thanks')[0].get('name') == "thanks":
            if msg.get('entities').get('thanks:thanks')[0].get('confidence') > 0.70:
                return "العفو"
    return "مرحبا"


def process_t3aruf(msg):
    if msg.get('entities').get('name:name') != None:
        if msg.get('entities').get('name:name')[0].get('name') == "name":
            if msg.get('entities').get('name:name')[0].get('confidence') > 0.70:
                return "أنا فريدة، مساعدتك الافتراضية "
    if msg.get('entities').get('country:country') != None:
        if msg.get('entities').get('country:country')[0].get('name') == "country":
            if msg.get('entities').get('country:country')[0].get('confidence') > 0.70:
                return "أنا من المملكة العربية السعودية"
    if msg.get('entities').get('age_of_person:age_of_person') != None:
        if msg.get('entities').get('age_of_person:age_of_person')[0].get('name') == "age_of_person":
            if msg.get('entities').get('age_of_person:age_of_person')[0].get('confidence') > 0.70:
                return "25"
    if msg.get('entities').get('how-r-u:how-r-u') != None:
        if msg.get('entities').get('how-r-u:how-r-u')[0].get('name') == "how-r-u":
            if msg.get('entities').get('how-r-u:how-r-u')[0].get('confidence') > 0.70:
                return "بخير الحمدلله"


def process_patent(msg):
    if msg.get('entities').get('p0:p0') != None:
        if msg.get('entities').get('p0:p0')[0].get('name') == "p0":
            return "البراءة هي مستند تمنحه السلطات المختصة (عادة مكتب البراءات )، بناء لطلب يتم إيداعه لديها يصف الاختراع . وينتج عن هذا المستند وضع قانوني يمنع الغير من استغلال هذه البراءة من دون تصريح صاحبها. بمعنى أخر، فإن البراءة تحمي الاختراع وتمنح صاحبه حقاً استئثارياً باستغلاله لمدة محددة. أما الاختراع فيمكن تعريفه بأنه حل جديد لمشكلة تقنية ما."
    if msg.get('entities').get('p1:p1') != None:
        if msg.get('entities').get('p1:p1')[0].get('name') == "p1":
            return "إن الغرض من البراءة هو توفير شكل من أشكال الحماية للتقدم التكنولوجي المستمر. ونظرًيًا، فإن الحماية بواسطة البراءة تكافئ ليس فقط عملية ابتكار الاختراع، بل أيضًا طريقة تنفيذ هذا الاختراع التي بفضلها يمكن تحقيقه تقنيًا وتسويقه. وهذا الحافز يؤدي إلى الحث على المزيد من الإبداع ويشجع الشركات على الاستمرار في تطوير تقنيات جديدة لتسويق ابتكاراتها وفي جعلها أكثر فائدة ومرغوبة أكثر للصالح العام."
    if msg.get('entities').get('p2:p2') != None:
        if msg.get('entities').get('p2:p2')[0].get('name') == "p2":
            return "للبراءات دور حافز للأفراد بالاعتراف بإبداعهم ومكافأتهم ماليا لاختراعاتهم التي يمكن تسويقها. وتشجع تلك الحوافز على الابتكار الذي يضمن تحسن نوعية الحياة البشرية باستمرار."
    if msg.get('entities').get('p3:p3') != None:
        if msg.get('entities').get('p3:p3')[0].get('name') == "p3":
            return "لقد تم تطوير هذا النظام خلال عدة قرون. نجد براءات يرجع تاريخها إلى حوالى العام 1700. لقد تطور النظام في السنوات الماضية ونحن الآن نملك نظاماً حديثاً جداً ولا نزال نعمل على تطوير النظام العالمي وتحديثه ومواءمته مع التغيرات التكنولوجي والتطور الاقتصادي."
    if msg.get('entities').get('p4:p4') != None:
        if msg.get('entities').get('p4:p4')[0].get('name') == "p4":
            return "توفر الاتفاقات الدولية الحماية بواسطة البراءات لكل الاختراعات (المنتجات والعمليات) التي يتم تطويرها في كل المجالات التقنية. فالتركيبة الكيمائية يمكن أن تحصل على البراءة وكذلك الآلات وعمليات تطوير أو تحسين أو صنع الأشياء."
    if msg.get('entities').get('p5:p5') != None:
        if msg.get('entities').get('p5:p5')[0].get('name') == "p5":
            return "هناك عدة ميزات يبحث عنها مكتب البراءات ليعتبر الاختراع قابلاً للحصول على البراءة. في البدء، لا بد من إيداع طلب البراءة . في معظم الحالات يقوم خبير فني بفحص هذا الطلب للتأكد من أنه مستوف للمعايير الموضوعية المطلوبة لاستصدار البراءة. أول هذه المعايير هي أن يكون الاختراع جديداً، بمعنى أنه يجب ألا يكون قد تم صنعه أو تنفيذه أو استخدامه من قبل. المعيار الثاني هو ضرورة وجود نشاط ابتكاري، بمعنى أن الاختراع يجب أن يمثل تقدماً كافياً في حالة التقنية الصناعية السابقة حتى يعتبر مستحقاً للبراءة. المعيار الثالث هو أن الاختراع يجب أن يكون قابلاً للتطبيق الصناعي، أي للاستخدام بطريقة ما."
    if msg.get('entities').get('p6:p6') != None:
        if msg.get('entities').get('p6:p6')[0].get('name') == "p6":
            return "الأشياء الموجودة في الطبيعة التي تكتشف ولا تخترع. فلا يمكن منح البراءة مثلاً لشخص اكتشف كوكباً جديدًا. الآلات التي تتحدى قوانين الطبيعة مثل آلة الحركة المستمرة. النظريات العلمية والقواعد الحسابية. المخططات، والقواعد والأساليب ولا سيما الأساليب التجارية وتلك التي تتعلق بالنشاط العقلي والألعاب. طرق التشخيص والعلاج والجراحة اللازمة لمعالجة البشر والحيوانات. (المنتجات المستخدمة في التشخيص يمكن أن تحصل على البراءة ). النباتات والحيوانات، خلاف الأحياء الدقيقة، والطرق البيولوجية أساساً لإنتاج النباتات والحيوانات، خلاف الأساليب والطرق غير البيولوجية والبيولوجية الدقيقة."
    if msg.get('entities').get('p7:p7') != None:
        if msg.get('entities').get('p7:p7')[0].get('name') == "p7":
            return "الإجابة العامة هي أنه خلال مدة الحماية يحق لمالك البراءة منع الآخرين من صنع أو استخدام أو بيع أو استيارد الاختراع المحمي بموجب هذه البراءة . ولكن يحق له أن يتنازل عن حقوقه (يبيعها) للغير أو أن ينشئ عقود ترخيص تسمح للغير باستغلال اختراعه."
    if msg.get('entities').get('p7:p7_1') != None:
        if msg.get('entities').get('p7:p7_1')[0].get('name') == "p7":
            return "تقنيًا وبصورة خاصة جدًا تكمن فوائد البراءة في كونها تعطي لصاحبها الحق بمنع الآخرين من صنع أو استخدام أو بيع أو استيراد الاختراع في الإقليم الذي تغطيه. وهذا لا يعطي بالضرورة المخترع أو صاحب البراءة الحق في استخدام الاختراع إذا اتضح مثلاً أن هذا الاستخدام غير قانوني (كما هي الحال بالنسبة إلى استخدام آلة القمار مثلاً) ولكنه يعطيه الحق في منع الآخرين من تسويق الاختراع والاستفادة منه خلال فترة زمنية محددة."
    if msg.get('entities').get('p8:p8') != None:
        if msg.get('entities').get('p8:p8')[0].get('name') == "p8":
            return "مدة الحماية هي على الأقل 20 عاما منذ تاريخ ايداع طلب البراءة"
    if msg.get('entities').get('p9:p9') != None:
        if msg.get('entities').get('p9:p9')[0].get('name') == "p9":
            return "نعم، إن مدة الحماية وبموجب اتفاقية دولية هي على الأقل 20 عاماً منذ تاريخ إيداع طلب البراءة ."
    if msg.get('entities').get('p10:p10') != None:
        if msg.get('entities').get('p10:p10')[0].get('name') == "p10":
            return "يتمتع صاحب البراءة بحق منع الآخرين من تنفيذ الاختراع موضوع البراءة أو استخدامه أو بيعه أو استيراده. ويمكنه منع تسويق الاختراع وبيعه ولكن هذا الحق لا يطبق إلا في البلدان التي منحت البراءة."
    if msg.get('entities').get('p11:p11') != None:
        if msg.get('entities').get('p11:p11')[0].get('name') == "p11":
            return "لا، لا يمكن ذلك في ظل نظام البراءات العالمي الحالي حيث لا توجد براءة واحدة تغطي كل بلدان العالم أو حتى عددا كبيرًا من البلدان في العالم. فنظام البراءات لا يزال نظاماً إقليميا؛ ولحماية اختراع ما في بلد معين ينبغي الحصول على براءة في هذا البلد. لكن يوجد اتفاق دولي تديره الويبو ويسمى معاهدة التعاون بشأن البراءات وهو يتناول إجراءات الإيداع والبحث والنشر والفحص للطلبات الدولية. وهذه المعاهدة تسهل الحصول على البراءات في الدول المتعاقدة إذ تنص على إيداع طلب دولي واحد ومتابعته في المكاتب الوطنية أو الإقليمية المختلفة للدول الأعضاء المعينة التي يعود لها وحدها وفق أحكام هذه المعاهدة أن تمنح البراءات."
    if msg.get('entities').get('p12:p12') != None:
        if msg.get('entities').get('p12:p12')[0].get('name') == "p12":
            return "هذا صحيح. إذا كنت تملك براءات في عشر دول، عليك أن تدفع رسوم الحفاظ عليها في كل بلد من هذه البلدان العشرة، وٕإذا تخلفت عن الدفع في أحد هذه البلدان فسوف يسقط حقك بالحماية التي توفرها البراءة ."
    if msg.get('entities').get('13:p13') != None:
        if msg.get('entities').get('p13:p13')[0].get('name') == "p13":
            return "إن البراءة هي أكثر الطرق فعالية لحماية الاختراع ولكن وكما ذكرت سابقا يتم منح البراءات مقابل قيام المخترع بالكشف الكامل عن الاختراع للجمهور. توجد طريقة أخرى فعالة للحصول على الحماية هي الاحتفاظ بسرية التقنية المستعملة من خلال اللجوء إلى ما يعرف بالأسرار التجارية التي يمكن بفضلها الاحتفاظ بسرية المعلومات التي تخص الاختراع. ولكن المشكلة في هذا النوع من الحماية أنه حالما يتم طرح المنتج في السوق يمكن تفكيكه وفحصه وتحليله واكتشاف السر وهذا يؤدي بالطبع إلى فقدان الحماية. أما في حالة البراءة ، فلا يهم أن يعرف الآخرون كيف يصنع المنتج من البراءة ، لأنه في الحقيقة يكفي قراءة طلب البراءة وبالتالي لا يهم أن تكون المعلومات مكشوفا عنها أو لا، لأنك عندما تحصل على البراءة فسوف تتمتع بالحماية. أما الحماية بواسطة الأسرار التجارية فهي متاحة دائمًا ويمكن أن تكون نافعة جدًا في مجال الدراية العملية، أي الخبرة التقنية الضرورية لاستخدام تقنية ما بأكبر فعالية."
    if msg.get('entities').get('p15:p15') != None:
        if msg.get('entities').get('p15:p15')[0].get('name') == "p15":
            return "البراءة حق استئثاري يمنح نظير اختراع يكون منتجاً أو عملية تتيح طريقة جديدة لإنجاز عمل ما أو تقدم حلا تقنيا جديدا لمشكلة ما."
    if msg.get('entities').get('p16:p16') != None:
        if msg.get('entities').get('p16:p16')[0].get('name') == "p16":
            return "• يجب أن يكون جديدا بحيث يبين بعض الخصائص الجديدة غير المعروفة في مجموعة المعارف المتوافرة في مجاله التقني، ويطلق على مجموعة المعارف تلك اسم) حالة التقنية الصناعية السابقة) .  • يجب أن يبين الاختراع نشاطا ابتكارية لا يمكن لأي شخص له معرفة متوسطة في المجال التقني استنتاجه.  • لا بد أن تكون له فائدة عملية وأن يكون قابلا للتطبيق الصناعي.  • يجب أن يكون الموضوع أهلا للبراءة بموجب القانون. وفي العديد من البلدان، تدخل النظريات العلمية أو مناهج العلوم الرياضية أو الأصناف النباتية أو الحيوانية أو الاكتشافات المتعلقة بالمواد الطبيعية أو المناهج التجارية أو أساليب العلاج الطبي (على عكس المستلزمات الطبية) في عداد الموضوعات غير الأهل للبراءة عامة."
    if msg.get('entities').get('p17:p17') != None:
        if msg.get('entities').get('p17:p17')[0].get('name') == "p17":
            return "• يجب أن يكون جديدًا بحيـث يبـين بعـض الخصـائص الجديـدة غيـر المعروفـة فـي مجموعـة المعــارف المتـــوافرة فـــي مجالــه التقنـــي. ويطلــق علـــى مجموعــة المعـــارف تلـــك اســم (حالـــة التقنيـــة الصـــناعية السابقة )  .  • ويجـب أن يبـين الاختـراع نشـاطا ابتكاريـاً لا يمكـن لأي شـخص لـه معرفـة متوسـطة فـي المجـال التقنـي استنتاجه.  • فلا بد أن تكون له فائدة عملية وأن يكون قابلاً للتطبيق الصناعي.  • وفي الأخير، يجب أن يكون الموضوع (أهلا للبراءة ) بموجـب القـانون. "
    if msg.get('entities').get('p18:p18') != None:
        if msg.get('entities').get('p18:p18')[0].get('name') == "p18":
            return "أكثر الطرق شيوعا واكثرها فعالية لحماية الاختراع هي من خلال الحصول على براءة .والبراءة تمنح من قبل مكتب البراءات في البلد المطلوب حماية الاختراع فيه .ومقابل حصوله على الحقوق الاستثمارية يلتزم المخترع بالكشف عن المعلومات المتعلقة بالاختراع . ومن الطرق الاخرى للحماية هي المحافظة على سرية التقنية وهو مايعرف بالاسرار التجارية . وتسمح الحماية بموجب الاسرار التجارية بالمحافظةعلى الطبيعة السرية للمعلومات وعلى عدم الكشف عن هذه المعلومات لاشخاص غير مصرح لهم "
    if msg.get('entities').get('p19:p19') != None:
        if msg.get('entities').get('p19:p19')[0].get('name') == "p19":
            return " نعم، تسمح الحماية بموجب الأسرار التجارية بالمحافظة على الطبيعة السرية للمعلومات وعلى عدم الكشف عن هذهالمعلومات لأشخاص غير مصرح لهم."
    if msg.get('entities').get('p20:p20') != None:
        if msg.get('entities').get('p20:p20')[0].get('name') == "p20":
            return " تشمل المرحلة الأولى من إجراءات الحصول على براءة إيداع طلب براءة. ويتضمن الطلب اسم الاختراع وبيانا بمجاله التقني عامة. ومن الضروري أن يشمل الطلب خلفية الاختراع ووصفا له بلغة واضحة وتفاصيل كافية لأي شخص له معرفة متوسطة في المجال كي يستعمل الاختراع أو ينفذه. وتكون تلك الأوصاف عادة مرفقة بمواد مرئية مثل الر سوم أو التصاميم أو الرسوم البيانية لوصف الاختراع بشكل أفضل. ويشمل الطلب عدة ( مطالب ) أيضا، أي المعلومات التي تحدد نطاق الحماية الممنوحة بموجب البراءة."
    if msg.get('entities').get('p21:p21') != None:
        if msg.get('entities').get('p21:p21')[0].get('name') == "p21":
            return "عـادة أمـام المحـاكم التـي لهـا صـلاحية وقـف التعـدي علـى البـراءات فـي معظم الأنظمة."
    if msg.get('entities').get('p22:p22') != None:
        if msg.get('entities').get('p22:p22')[0].get('name') == "p22":
            return "لمالك البراءة الحق في تقرير من الـذي يجـوز لـه أو لا يجـوز لـه الانتفـاع بالاختراع المشمول بالبراءة خلال مدة حماية الاختراع. ويجوز لمالك البـراءة التصريح للغيـر أو التـرخيص له بالانتفاع بالاختراع وفقا لشروط متفق عليها ويجـوز لمالـك البـراءة أيضـا بيـع حقـه فـي الاختـراع لشـخص آخـر يصـبح بـذلك مالـك البـراءة الجديـد. وعنـد انقضاء مدة البـراءة، تنتهـي الحمايـة ويـؤول الاختـراع إلـى الملـك العـام. وهـذا يعنـي أن مالـك البـراءة لـم يعـد يتمتع بالحقوق الاستئثارية في الاختراع الذي يصبح في متناول الغير لاستغلاله في التجارة."
    if msg.get('entities').get('p23:p23') != None:
        if msg.get('entities').get('p23:p23')[0].get('name') == "p23":
            return "يمـنح البـراءة المكتـب الـوطني للبـراءات أو المكتـب الإقليمـي الـذي يعمـل لصـالح عـدة بلـدان مثـل المكتـب الأوروبي للبراءات والمنظمة الإقليمية الأفريقيـة للملكيـة الصـناعية أو مكتـب البـراءات لـدول مجلـس التعـاون الخليجـي. وبنـاء علـى تلـك الأنظمـة الإقليميـة، يلـتمس مـودع الطلـب حمايـة الاختـراع فـي بلـد واحـد أو أكثـر ويبت كل بلد في منح الحماية بالبراءة في أراضيه من عدم منحها وتنص معاهدة التعاون بشأن البراءات التـي تـديرها الويبـو علـى إيـداع طلـب دولـي واحـد للبـراءة تكـون لـه الآثار ذاتها المترتبة على الطلبات الوطنية المودعة في البلدان المعينة. ويجوز لمودع الطلب الذي يلـتمس الحمايـة أن يـودع طلبـا واحـدا ويلـتمس الحمايـة فـي العـدد الـذي يـراه مناسـبا مـن البلـدان الموقعـة. ولا تمـنح معاهـدة التعـاون بشـأن البـراءات (بـراءة دوليـة)، ولكنهـا تبسـط فقـط إجـراءات الإيـداع والبحـث والفحـص. أمـا اختصاص منح البراءة فيعود فقط للمكاتب الوطنية أو الإقليمية كما سبق وذكرنا."

    if msg.get('entities').get('p24:p24') != None:
        if msg.get('entities').get('p24:p24')[0].get('name') == "p24":
            return conversation()
    if msg.get('entities').get('ip_registration:registration') != None:
        if msg.get('entities').get('ip_registration:registration')[0].get('name') == "ip_registration:":
            return conversation()

    if msg.get('entities').get('p25:p25') != None:
        if msg.get('entities').get('p25:p25')[0].get('name') == "p25":
            return "الحماية تبدأ من تاريخ الإيداع"
    if msg.get('entities').get('p26:p26') != None:
        if msg.get('entities').get('p26:p26')[0].get('name') == "p26":
            return " إن الجهة المختصة بالنظر في انتهاك براءات الاختراع و النماذج الصناعية هي وزارة العدل"
    if msg.get('entities').get('p27:p27') != None:
        if msg.get('entities').get('p27:p27')[0].get('name') == "p27":
            return "لا يوجد حماية فكرية للتطبيقات الحماية لأكواد البرمجة يمكنكم تسجيلها و إصدار شهادة ملكية للتطبيق على الرابط التالي: https://t.co/PCf2eZnu1s…"
    if msg.get('entities').get('p28:p28') != None:
        if msg.get('entities').get('p28:p28')[0].get('name') == "p28":
            return "عند تقديمكم للطلب مستوفي الشروط و سداد الرسوم المقررة"
    if msg.get('entities').get('p30:p30') != None:
        if msg.get('entities').get('p30:p30')[0].get('name') == "p30":
            return "الرسوم التي يتم دفعها لا تسترد"
    if msg.get('entities').get('p31:p31') != None:
        if msg.get('entities').get('p31:p31')[0].get('name') == "p31":
            return "عناصر الحماية هي ما يميز الاختراع الخاص بكم عن الاختراعات الموجودة"
    if msg.get('entities').get('p33:p33') != None:
        if msg.get('entities').get('p33:p33')[0].get('name') == "p33":
            return "يؤسفنا ان الاكتشافات و طرق معالجة جسم الإنسان، أو الحيوان جراحياً، أو علاجياً، وطرق تشخيص المرض المطبقة على جسم الإنسان أو الحيوان لا يوجد لها حقوق فكرية, ويستثنى من ذلك المنتجات التي تستعمل في أي من تلك الطرق"
    if msg.get('entities').get('p32:p32') != None:
        if msg.get('entities').get('p32:p32')[0].get('name') == "p32":
            return "حالياً لا توجد خدمة الرهن لبرءات الاختراع."
    if msg.get('entities').get('p34:p34') != None:
        if msg.get('entities').get('p34:p34')[0].get('name') == "p34":
            return "البراءات تحمى لمدة عشرون سنه وفي حال الانتهاك لبراءة مسجلة يتم رفع دعوى لدا المحاكم المختصة ."
    if msg.get('entities').get('p35:p35') != None:
        if msg.get('entities').get('p35:p35')[0].get('name') == "p35":
            return "تبدأ الحماية من تاريخ الإيداع، و الحصول على شهادة براءة الاختراع بعد اجتياز عدة مراحل يقرر الفاحص بالمنح أو الرفض."
    if msg.get('entities').get('p36:p36') != None:
        if msg.get('entities').get('p36:p36')[0].get('name') == "p36":
            return "التصاميم المعمارية محمية من تاريخ النشر لها مباشره و يمكنكم تسجيلها في  خدمة التسجيل الاختياري عبر الموقع الرسمي للهيئة على الرابط التالي : https://t.co/PCf2eZF5q2"
    if msg.get('entities').get('p37:p37') != None:
        if msg.get('entities').get('p37:p37')[0].get('name') == "p37":
            return "عناصر الحماية هي ما يميز الاختراع الخاص بكم عن الاختراعات الموجودة."
    if msg.get('entities').get('p38:p38') != None:
        if msg.get('entities').get('p38:p38')[0].get('name') == "p38":
            return "في حال انتهاك براءة الاختراع الخاصة بكم، يمكنكم التواصل مع لجنة النظر في  دعاوى براءات الاختراع و النماذج الصناعية على البريد الإلكتروني التالي : Plc@saip.gov.sa"
    if msg.get('entities').get('p39:p39') != None:
        if msg.get('entities').get('p39:p39')[0].get('name') == "p39":
            return "يوجد لدى الهيئة مسار خاص بالدارات المتكاملة و يمكنكم تسجيلها على الرابط  التالي : https://t.co/Qhv8X2DbpZ"
    if msg.get('entities').get('p40:p40') != None:
        if msg.get('entities').get('p40:p40')[0].get('name') == "p40":
            return "يمكنكم الإطلاع على أخر المستجدات عبر الدخول على حسابكم في نظام براءات الاختراع على الرابط التالي : https://t.co/tebmct0qDV"
    if msg.get('entities').get('p41:p41') != None:
        if msg.get('entities').get('p41:p41')[0].get('name') == "p41":
            return "تم تعريف المسار السريع في هذا التصميم يمكنك الاطلاع عليه ويسعدنا توصلكم https://t.co/s4t8c5wYJc https://t.co/088l5SCb79"
    if msg.get('entities').get('p42:p42') != None:
        if msg.get('entities').get('p42:p42')[0].get('name') == "p42":
            return "أهلاً بك، يمكنك تقديم دعوى أمام لجنة النظر في دعاوى براءات الاختراع بمدينة الملك عبدالعزيز للعلوم والتقنية كونها الجهة المختصة حالياً بالنماذج الصناعية."
    if msg.get('entities').get('p43:p43') != None:
        if msg.get('entities').get('p43:p43')[0].get('name') == "p43":
            return " شكراً لتواصلكم ، حماية الاختراع تكون داخل نطاق الدولة المانحة لشهادة براءة الاختراع."
    if msg.get('entities').get('p44:p44') != None:
        if msg.get('entities').get('p44:p44')[0].get('name') == "p44":
            return "يمكنكم الإطلاع على النظام و اللائحة التنفيذية لبراءات الاختراع و حق المؤلف على الرابط التالي: https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('p45:p45') != None:
        if msg.get('entities').get('p45:p45')[0].get('name') == "p45":
            return "الحماية تكون في نطاق الدول التي تم التسجيل و منح براءة الاختراع فيها، و يمكنكم الاطلاع على النظام و اللائحة التنفيذية لبراءات الاختراع على الرابط التالي:https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('p46:p46') != None:
        if msg.get('entities').get('p46:p46')[0].get('name') == "p46":
            return "يمكنكم الاطلاع على الرسوم من خلال اللائحة التنفيذية  على الرابط التالي: https://t.co/xNRlaTz2fH "
    if msg.get('entities').get('p47:p47') != None:
        if msg.get('entities').get('p47:p47')[0].get('name') == "p47":
            return "يمكنكم الاطلاع على المدة النظامية من خلال اللائحة التنفيذية لنظام براءات الاختراع عبر الرابط التالي : https://t.co/aN862sq7Pw"
    if msg.get('entities').get('p48:p48') != None:
        if msg.get('entities').get('p48:p48')[0].get('name') == "p48":
            return " الرسومات ليست ألزامية للتقديم على طلب براءة اختراع "
    if msg.get('entities').get('p49:p49') != None:
        if msg.get('entities').get('p49:p49')[0].get('name') == "p49":
            return "نعم ، الإختراعات هي تطوير لإختراعات سابقة. و يمكنكم الاطلاع على النظام و اللائحة التنفيذية البراءات الاختراع : https://t.co/6z0nBgA7hv"
    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


def process_ip(msg):
    if msg.get('entities').get('ip1:ip1') != None:
        if msg.get('entities').get('ip1:ip1')[0].get('name') == "ip1":
            return "تعني الملكية أن ﻟﻠﻣﺎﻟك اﻟﺣرﻳﺔ اﻟﻣطﻠﻘﺔ ﻓﻲ اﺳﺗﻌﻣﺎﻝ ﻣﻠﻛﻳﺗﻪ أو ﻓﻲ ﻣﻧﻊ اﻵﺧرﻳن ﻣن اﺳﺗﻌﻣﺎﻟﻬﺎ وذﻟك ﻓﻲ ﻧطﺎق ﻣﺎ ﻳﺳﻣﺢ ﺑﻪ اﻟﻘﺎﻧون. وﻳﻘﺗﺻر اﺳﺗﻌﻣﺎﻝ ﻣﺻطﻠﺢ اﻟﻣﻠﻛﻳﺔ اﻟﻔﻛرﻳﺔ ﻓﻲ أﻳﺎﻣﻧﺎ اﻟﺣﺎﺿرة ﻋﻠﻰ أﻧواع اﻟﻣﻠﻛﻳﺔ اﻟﺗﻲ ﻳﺑدﻋﻬﺎ اﻟﻔﻛر اﻹﻧﺳﺎﻧﻲ."

    if msg.get('entities').get('ip2:ip2') != None:
        if msg.get('entities').get('ip2:ip2')[0].get('name') == "ip2":
            return "ﺑﺣﺳب اﻟﻔﻘرة اﻟﺛﺎﻣﻧﺔ ﻣن اﻟﻣﺎدة اﻟﺛﺎﻧﻳﺔ ﻣن اﺗﻔﺎﻗﻳﺔ إﻧﺷﺎء اﻟﻣﻧظﻣﺔ اﻟﻌﺎﻟﻣﻳﺔ ﻟﻠﻣﻠﻛﻳﺔ اﻟﻔﻛرﻳﺔ فتشمل هذه الحقوق ﻣﺎ ﻳﻠﻲ: - اﻟﻣﺻﻧﻔﺎت اﻷدﺑﻳﺔ واﻟﻔﻧﻳﺔ واﻟﻌﻠﻣﻳﺔ. - إﻧﺟﺎزت اﻟﻔﻧﺎﻧﻳن اﻟﻘﺎﺋﻣﻳن ﺑﺎﻷداء واﻟﻔوﻧوﻏراﻣﺎت واﻟﺗﻠﻔزﻳون. - اﻻﺧﺗراﻋﺎت ﻓﻲ ﺟﻣﻳﻊ ﻣﺟﺎﻻت اﻻﺟﺗﻬﺎد الإنساني. - الاكتشافات اﻟﻌﻠﻣﻳﺔ. - اﻟﺗﺻﺎﻣﻳم اﻟﺻﻧﺎﻋﻳﺔ. - العلامات اﻟﺗﺟﺎرﻳﺔ وعلامات الخدمة والأسماء والسمات التجارية. - الحماية من المنافسة غير المشروعة. وجميع الحقوق الأخرى الناتجة عن النشاط الفكري في المجالات الصناعية والعلمية والأدبية والفنية."

    if msg.get('entities').get('ip3:ip3_1') != None:
        if msg.get('entities').get('ip3:ip3_1')[0].get('name') == "ip3":
            return "العلامات التجارية."

    if msg.get('entities').get('ip3:ip3_2') != None:
        if msg.get('entities').get('ip3:ip3_2')[0].get('name') == "ip3":
            return "الحقوق المجاورة لحق المؤلف."

    if msg.get('entities').get('ip3:ip3_3') != None:
        if msg.get('entities').get('ip3:ip3_3')[0].get('name') == "ip3":
            return "براءات الاختراع"

    if msg.get('entities').get('ip3:ip3_4') != None:
        if msg.get('entities').get('ip3:ip3_4')[0].get('name') == "ip3":
            return "التصاميم الصناعية"

    if msg.get('entities').get('ip3:ip3_5') != None:
        if msg.get('entities').get('ip3:ip3_5')[0].get('name') == "ip3":
            return "المنافسة غير المشروعة."

    if msg.get('entities').get('ip4:ip4') != None:
        if msg.get('entities').get('ip4:ip4')[0].get('name') == "ip4":
            return "السبب الأول للاهتمام بحماية الملكية الفكرية هو الرغبة في تأمين العدالة التي تسمح لأي شخص بذل جهدًا ووقتا في ابتكار عمل ما بأن ينتفع ماديًا من عمله هذا. والسبب الثاني هو أن الحماية الممنوحة للملكية الفكرية تشجع المبدعين كثيرًا على القيام بمزيد من الابتكارات، نظرًا للمردود المادي لأعمالهم هذه فتنمو بذلك وتزدهر الصناعات والشركات القائمة على تلك الابتكارات."

    if msg.get('entities').get('ip3:ip3_6') != None:
        if msg.get('entities').get('ip3:ip3_6')[0].get('name') == "ip3":
            return "حماية هذا النوع من الملكية ترعاه قوانين حق المؤلف."

    if msg.get('entities').get('ip3:ip3_7') != None:
        if msg.get('entities').get('ip3:ip3_7')[0].get('name') == "ip3":
            return "حماية هذا النوع من الملكية ترعاه قوانين حق المؤلف."

    if msg.get('entities').get('ip3:ip3_8') != None:
        if msg.get('entities').get('ip3:ip3_8')[0].get('name') == "ip3":
            return "حماية هذا النوع من الملكية ترعاه قوانين الحقوق المجاورة لحق المؤلف"
    if msg.get('entities').get('ip3:ip3_9') != None:
        if msg.get('entities').get('ip3:ip3_9')[0].get('name') == "ip3":
            return "حماية هذا النوع من الملكية ترعاه قوانين الحقوق المجاورة لحق المؤلف"

    if msg.get('entities').get('ip3:ip3_10') != None:
        if msg.get('entities').get('ip3:ip3_10')[0].get('name') == "ip3":
            return "حماية الاختراعات تتم بواسطة قوانين البراءات"

    if msg.get('entities').get('ip3:ip3_11') != None:
        if msg.get('entities').get('ip3:ip3_11')[0].get('name') == "ip3":
            return "حماية التصاميم الصناعية تتم بواسطة التشريعات الخاصة بها أو من خلال قوانين الملكية الصناعية أو من خلال قانون حق المؤلف"

    if msg.get('entities').get('ip5:ip5_regulation') != None:
        if msg.get('entities').get('ip5:ip5_regulation')[0].get('name') == "ip5":
            return "تشجيع الإبداع الفكري من خلال توفير الحماية له؛ الاعتراف الرسمي بالمبدعين؛ خلق بنوك للمعلومات تتضمن معلومات حيوية؛ تسهيل نمو الصناعة والثقافة المحلية والتجارة الدولية من خلال المعاهدات التي تقدم الحماية المتعددة الأطراف"

    if msg.get('entities').get('ip6:ip6_resources') != None:
        if msg.get('entities').get('ip6:ip6_resources')[0].get('name') == "ip6":
            return "للتعمق في هذا الموضوع وللمزيد من المراجع يمكن زيارة الموقعين التالين https://www.wipo.int/about-ip/en والموقع http://www.wipo.int/ar/treaties/index.html "

    if msg.get('entities').get('ip7:ip7_trespass') != None:
        if msg.get('entities').get('ip7:ip7_trespass')[0].get('name') == "ip7":
            return "في حال اكتشفت أنه تم التعدي على حقوق الملكية الفكرية الخاصة بك، ننصحك باللجوء إلى محامي أو مؤسسة مختصة بإنفاذ الحقوق في بلدك"

    if msg.get('entities').get('idea:idea') != None:
        if msg.get('entities').get('idea:idea')[0].get('name') == "idea":
            return "الأفكار المجردة مستثناة من الحماية بموجب النظام، وعنذ تطبيقها يحمى التعبير عنها وليست الفكرة نفسها. ويمكنك الاطلاع على النظام واللائحة التنفيذية على الرابط التالي: https://www.saip.gov.sa/ar/laws-regulations/"

    if msg.get('entities').get('ip_authority:authority') != None:
        if msg.get('entities').get('ip_authority:authority')[0].get('name') == "ip_authority":
            return " الهيئة تهدف إلى تنظيم مجالات الملكية الفكرية في المملكة، ودعمها، وتنميتها، ورعايتها، وحمايتها، وانفاذها، والارتقاء بها وفق أفضل الممارسات العالمية وهي أحد مبادرات رؤية المملكة ٢٠٣٠ حيث صدرت موافقة مجلس الوزراء بنقل اختصاص براءات الاختراع والعلامات التجارية وحقوق المؤلف للهيئة"

    if msg.get('entities').get('ip_tweet:tweet') != None:
        if msg.get('entities').get('ip_tweet:tweet')[0].get('name') == "ip_tweet":
            return " التغريدات الإبداعية محميه لأصحابها، ويستثنى الكلام العام أو الرأي العام وماشابهه"

    if msg.get('entities').get('ip_fields:fields') != None:
        if msg.get('entities').get('ip_fields:fields')[0].get('name') == "ip_fields":
            return "العلامات التجارية، حقوق المؤلف، براءات الاختراع، النماذج الصناعية، الأصناف النباتية، وغيرها من المجالات...  وكل هذه التفاصيل موجودة في موقعنا حياك https://t.co/auFD913Kxd   :مجالات حقوق الملكية الفكرية تشمل"

    if msg.get('entities').get('ip_registration:registration') != None:
        if msg.get('entities').get('ip_registration:registration')[0].get('name') == "ip_registration":
            return """يمكنك التسجيل لـ:
1 - البراءات (التصاميم المعمارية، النماذج الصناعية، الأصناف النباتية، التطبيقات الإلكترونية، تصاميم الدارات المتكاملة) عن طريق الرابط: epatentsso.saip.gov.sa 
2- الاعمال المحمية بنظام حقوق المؤلف والحقوق المجاورة عن طريق الرابط: copyright.saip.gov.sa
3-  العلانات التجارية عن طريق الرابط: tm.saip.gov.sa
4- ترخيص ممارسة أنشطة الملكية الفكرية عن طريق الرابط: agent.saip.gov.sa """

    if msg.get('entities').get('ip_geographicLoc:geographicLoc') != None:
        if msg.get('entities').get('ip_geographicLoc:geographicLoc')[0].get('name') == "ip_geographicLoc":
            return " النطاق الجغرافي للحماية يختلف حسب مجالات الملكية الفكرية، على سبيل المثال لا يوجد شهادة دولية تحمي براءة الاختراع بجميع دول العالم، اما حق المؤلف فهو محمي تلقائياً بجميع دول العالم، والعلامة التجارية تحمى بالدولة المسجل بها وبالفئة المختارة"

    if msg.get('entities').get('ip_enforcement:enforcement') != None:
        if msg.get('entities').get('ip_enforcement:enforcement')[0].get('name') == "ip_enforcement":
            return """ ينص اتفاق تريبس ومعه القوانين الوطنية على مجموعة من آليات الإنفاذ الفعالة وهي:
        - التدابير المؤقتة، كالبحث ومصادرة السلع التي يشتبه في أنها متعدية والمعدات المستخدمة في صنع هذه السلع
         - الإجراءات المدنية كدفع التعويضات المالية وإتلاف السلع المتعدية
          - الأوامر القضائية لكف التعدي الحاصل أو لتفادي حصوله
           - الإجراءات الجنائية كالحبس والغرامة
           - التدابير الحدودية لوقف الإفراج عن السلع المستوردة التي يظن أنها منتحلة ومنع تداولها"""

    if msg.get('entities').get('ip_traditionKnowladge:traditionKnowladge') != None:
        if msg.get('entities').get('ip_traditionKnowladge:traditionKnowladge')[0].get(
                'name') == "ip_traditionKnowladge":
            return "يسعى العديد من أصحاب المعارف التقليدية إلى إدراج المعارف التقليدية وأشكال التعبير الثقافي في إطار من التنمية الاقتصادية والاجتماعية المستدامة، من خلال اللجوء إلى مختلف نهج الملكية الفكرية، بما في ذلك قوانين البراءات والعلامات التجارية وحق المؤلف. ويستعين أصحاب المعارف التقليدية كذلك بما يسمى بالقوانين الخاصة أو المصاغة خصيصا لحماية المعارف التقليدية، أو أشكال التعبير التقليدي الثقافي، أو الفلكلور، حيث وجدت"

    if msg.get('entities').get('ip_geneticResources:geneticResources1') != None:
        if msg.get('entities').get('ip_geneticResources:geneticResources1')[0].get('name') == "ip_geneticResources":
            return "الموارد الوراثية ذات القيمة الفعلية أو المحتملة، بما فيها عناصر التنوع البيولوجي في وضعها الطبيعي، والأصناف والسلالات الحديثة أو التقليدية المستخدمة في الزراعة، والأصول الوراثية الخاصة"

    if msg.get('entities').get('ip_geneticResources:geneticResources2') != None:
        if msg.get('entities').get('ip_geneticResources:geneticResources2')[0].get('name') == "ip_geneticResources":
            return "يمكن أن تساهم الموارد الوراثية مساهمة مهمة في البحث والتطوير الابتكار منتجات جديدة، وذلك في عدد متزايد من القطاعات التكنولوجية والصناعية. ومن المسائل البالغة الأهمية في هذا الصدد، شروط النفاذ إلى الموارد الوراثية، والتزام موفري الموارد الوراثية بمبدأ الموافقة المسبقة والمستنيرة، وما يترتب على ذلك من تدابير لاقتسام المنافع التي يثرها استخدام الموارد الوراثية وتنميتها"

    if msg.get('entities').get('ip_geneticResources:geneticResources3') != None:
        if msg.get('entities').get('ip_geneticResources:geneticResources3')[0].get('name') == "ip_geneticResources":
            return "أتاحت القوانين الدولية وعدد من القوانين واللوائح الإقليمية والوطنية ودون الوطنية، وضع إطار التطبيق مبدأ الموافقة المسبقة والمستنيرة للنفاذ إلى الموارد الوراثية، وتحديد شروط هذا النفاذ، لا سيما ضمان استخدام هذه الموارد استخدامة مستدامة واقتسام منافعه بإنصاف. وتشمل العناصر الرئيسية من القانون الدولي، اتفاقية التنوع البيولوجي والمعاهدة الدولية بشأن الموارد الوراثية النباتية للأغذية والزراعة التابعة لمنظمة الأغذية والزراعة. وفي إطار الاتفاقات المبرمة بشأن النفاذ إلى الموارد الوراثية واقتسام المنافع والنظم القانونية التي تتيح هذا النفاذ، تكتسي التدابير الخاصة المتصلة بإدارة الملكية الفكرية أهمية بالغة لأنها تضمن مراعاة هذه الاتفاقات لضرورة أن يعود النفاذ إلى الموارد الوراثية بمنافع محددة، وتكفل الاقتسام المنصف لهذه المنافع والاحترام التام لمصالح ومشاغل موفري هذه الموارد"

    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


if __name__ == "__main__":
    while True:
        sentence = input()
        if sentence == "quit":
            break
        resp = handle_message(sentence)
        print(resp)


